Terraform plan on Test

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-4s will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "http-requests-latency-fhir-eob-4s" {
        actions_enabled           = true
        alarm_actions             = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      ~ alarm_description         = "HTTP EOB Request Latency p99 exceeds 6000.0 seconds in APP-ENV: bfd-test over 3600 seconds" -> "HTTP EOB Request Latency p90 exceeds 4000.0 seconds in APP-ENV: bfd-test over 900 seconds"
        alarm_name                = "bfd-test-http-requests-latency-fhir-eob"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-http-requests-latency-fhir-eob"
        comparison_operator       = "GreaterThanThreshold"
        datapoints_to_alarm       = 1
        dimensions                = {}
        evaluation_periods        = 1
      ~ extended_statistic        = "p99" -> "p90"
        id                        = "bfd-test-http-requests-latency-fhir-eob"
        insufficient_data_actions = []
        metric_name               = "http-requests/latency/fhir/eob"
        namespace                 = "bfd-test/bfd-server"
        ok_actions                = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      ~ period                    = 3600 -> 900
        tags                      = {}
      ~ threshold                 = 6000 -> 4000
        treat_missing_data        = "notBreaching"
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_group.main must be replaced
+/- resource "aws_autoscaling_group" "main" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:autoScalingGroup:d95e348f-d746-41a1-a490-4dd836adae70:autoScalingGroupName/bfd-test-fhir-111" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 3
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
      ~ id                        = "bfd-test-fhir-111" -> (known after apply)
        load_balancers            = [
            "bfd-test-fhir",
        ]
        max_size                  = 6
        metrics_granularity       = "1Minute"
        min_elb_capacity          = 3
        min_size                  = 3
      ~ name                      = "bfd-test-fhir-111" -> (known after apply) # forces replacement
        protect_from_scale_in     = false
      ~ service_linked_role_arn   = "arn:aws:iam::577373831711:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      ~ target_group_arns         = [] -> (known after apply)
      - termination_policies      = [] -> null
        vpc_zone_identifier       = [
            "subnet-0334c1f4eec7a52af",
            "subnet-059284636c71808eb",
            "subnet-0a6ee82462453afbb",
        ]
        wait_for_capacity_timeout = "10m"
        wait_for_elb_capacity     = 3

      ~ launch_template {
          ~ id      = "lt-08cf8a855a25fdbf7" -> (known after apply)
            name    = "bfd-test-fhir"
          ~ version = "111" -> (known after apply)
        }

        tag {
            key                 = "Environment"
            propagate_at_launch = true
            value               = "test"
        }
        tag {
            key                 = "Layer"
            propagate_at_launch = true
            value               = "app"
        }
        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "bfd-test-fhir"
        }
        tag {
            key                 = "application"
            propagate_at_launch = true
            value               = "bfd"
        }
        tag {
            key                 = "business"
            propagate_at_launch = true
            value               = "oeda"
        }
        tag {
            key                 = "role"
            propagate_at_launch = true
            value               = "fhir"
        }
        tag {
            key                 = "stack"
            propagate_at_launch = true
            value               = "test"
        }
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.high-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "high-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:7c0a1dc9-aecb-49a4-809d-71a9b9969b6f:autoScalingGroupName/bfd-test-fhir-111:policyName/bfd-test-fhir-high-cpu-scaleup" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-test-fhir-111" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-test-fhir-high-cpu-scaleup" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-test-fhir-high-cpu-scaleup"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = 2
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.low-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "low-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:80e04cb9-a32e-425b-9ff0-e3e3139b061d:autoScalingGroupName/bfd-test-fhir-111:policyName/bfd-test-fhir-low-cpu-scaledown" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-test-fhir-111" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-test-fhir-low-cpu-scaledown" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-test-fhir-low-cpu-scaledown"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = -1
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.high-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:7c0a1dc9-aecb-49a4-809d-71a9b9969b6f:autoScalingGroupName/bfd-test-fhir-111:policyName/bfd-test-fhir-high-cpu-scaleup",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-test-fhir-111 ASG" -> (known after apply)
        alarm_name                = "bfd-test-fhir-high-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-fhir-high-cpu"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-test-fhir-111"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-test-fhir-high-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 60
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.low-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "low-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:80e04cb9-a32e-425b-9ff0-e3e3139b061d:autoScalingGroupName/bfd-test-fhir-111:policyName/bfd-test-fhir-low-cpu-scaledown",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-test-fhir-111 ASG" -> (known after apply)
        alarm_name                = "bfd-test-fhir-low-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-fhir-low-cpu"
        comparison_operator       = "LessThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-test-fhir-111"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-test-fhir-low-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 20
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_launch_template.main will be updated in-place
  ~ resource "aws_launch_template" "main" {
        arn                     = "arn:aws:ec2:us-east-1:577373831711:launch-template/lt-08cf8a855a25fdbf7"
        default_version         = 1
        description             = "Template for the test environment fhir servers"
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-08cf8a855a25fdbf7"
        image_id                = "ami-0bd1cad30d34efbcf"
      ~ instance_type           = "m5.2xlarge" -> "m5.xlarge"
        key_name                = "bfd-test"
      ~ latest_version          = 111 -> (known after apply)
        name                    = "bfd-test-fhir"
        security_group_names    = []
        tags                    = {}
        user_data               = "IyEvYmluL2Jhc2gKc2V0IC1lCgpleGVjID4gPih0ZWUgLWEgL3Zhci9sb2cvdXNlcl9kYXRhLmxvZyAyPiYxKQoKZ2l0IGNsb25lIGh0dHBzOi8vZ2l0aHViLmNvbS9DTVNnb3YvYmVuZWZpY2lhcnktZmhpci1kYXRhLmdpdCAtLWJyYW5jaCBtYXN0ZXIgLS1zaW5nbGUtYnJhbmNoCgpjZCBiZW5lZmljaWFyeS1maGlyLWRhdGEvb3BzL2Fuc2libGUvcGxheWJvb2tzLWNjcy8KCmdpdCBjaGVja291dCBtYXN0ZXIKCmF3cyBzMyBjcCBzMzovL2JmZC1tZ210LWFkbWluLTU3NzM3MzgzMTcxMS9hbnNpYmxlL3ZhdWx0LnBhc3N3b3JkIC4KCiMgVGhlIGV4dHJhX3ZhcnMuanNvbiBmaWxlIGZyb20gdGhlIHByZXZpb3VzIGJ1aWxkIHN0ZXAgY29udGFpbnMgYSBmZXcgaW5jb3JyZWN0IHZhbHVlcwojIGFuZCBuZWVkcyB0byBnZXQgdHJpbW1lZCBkb3duIHRvIHRoZSBmb2xsb3dpbmcKY2F0IDw8RU9GID4+IGV4dHJhX3ZhcnMuanNvbgp7CiAgICAiZW52IjoidGVzdCIsCiAgICAiZGF0YV9zZXJ2ZXJfdmVyc2lvbiI6IjEuMC4wLVNOQVBTSE9UIgp9CkVPRgoKYW5zaWJsZS1wbGF5Ym9vayAtLWV4dHJhLXZhcnMgJ0BleHRyYV92YXJzLmpzb24nIC0tdmF1bHQtcGFzc3dvcmQtZmlsZT12YXVsdC5wYXNzd29yZCAtLXRhZ3MgInBvc3QtYW1pIiBsYXVuY2hfYmZkLXNlcnZlci55bWwKCnJtIHZhdWx0LnBhc3N3b3JkCg=="
        vpc_security_group_ids  = [
            "sg-08c2e0d1154beffde",
            "sg-0cdc89644d5f3499d",
        ]

        block_device_mappings {
            device_name = "/dev/sda1"

            ebs {
                delete_on_termination = "true"
                encrypted             = "true"
                iops                  = 0
                kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449"
                volume_size           = 100
                volume_type           = "gp2"
            }
        }

        iam_instance_profile {
            name = "bfd-test-fhir-profile"
        }

        monitoring {
            enabled = true
        }

        placement {
            tenancy = "default"
        }

        tag_specifications {
            resource_type = "instance"
            tags          = {
                "Environment" = "test"
                "Layer"       = "app"
                "Name"        = "bfd-test-fhir"
                "application" = "bfd"
                "business"    = "oeda"
                "role"        = "fhir"
                "stack"       = "test"
            }
        }
        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Environment" = "test"
                "Layer"       = "app"
                "Name"        = "bfd-test-fhir"
                "application" = "bfd"
                "business"    = "oeda"
                "role"        = "fhir"
                "snapshot"    = "true"
                "stack"       = "test"
            }
        }
    }

  # module.stateless.module.bfd_pipeline.module.ec2_instance.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
        ami                          = "ami-041004cfa268146b1"
      ~ arn                          = "arn:aws:ec2:us-east-1:577373831711:instance/i-0e25b466335b02021" -> (known after apply)
        associate_public_ip_address  = false
        availability_zone            = "us-east-1b"
      ~ cpu_core_count               = 4 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
        ebs_optimized                = true
        get_password_data            = false
      + host_id                      = (known after apply)
        iam_instance_profile         = "bfd-test-bfd_pipeline-profile"
      ~ id                           = "i-0e25b466335b02021" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ instance_type                = "m5.2xlarge" -> "m5.xlarge"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "bfd-test"
        monitoring                   = true
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0a98b2d702de06cd3" -> (known after apply)
      ~ private_dns                  = "ip-10-235-21-46.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.235.21.46" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "subnet-048c7b59678709fa4"
        tags                         = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "test"
        }
        tenancy                      = "default"
      ~ user_data                    = "1b897c6e801ffdad8c360659b134b7a145c7f352" -> "e216988020ccbebb7bd592d13eb85466506a3bf8" # forces replacement
        volume_tags                  = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "snapshot"    = "true"
            "stack"       = "test"
        }
        vpc_security_group_ids       = [
            "sg-01b241e4a5490c632",
            "sg-0a1a9d02fe5ac3891",
            "sg-0ea67e016d7cfd91e",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
            encrypted             = true
          ~ iops                  = 300 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449" -> "alias/bfd-test-cmk" # forces replacement
          ~ volume_id             = "vol-0bf972cb25398da82" -> (known after apply)
          ~ volume_size           = 100 -> 200 # forces replacement
            volume_type           = "gp2"
        }
    }
```